Catalogs/РегламентныеИнтервалы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>РегламентныеИнтервалы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ШаблоныПроцессов</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПоддержки</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторНачальногоЭтапа</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторКонечногоЭтапа</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокЗависитОтВремениНачала</Name>
					<Comment>Ложь - не зависит (указывается один срок), Истина - зависит (указывается два срока)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокВыполненияЧасы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокВыполненияДни</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособУказанияВремениОкончания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокВыполненияЧасыПосле</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокВыполненияДниПосле</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособУказанияВремениОкончанияПосле</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОкончанияПосле</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Куратор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РолиИсполнителей</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойОбъектАдресацииКуратора</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ОбъектыАдресацииЗадач</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныйОбъектАдресацииКуратора</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ОбъектыАдресацииЗадач</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаИсполнителейЗадачКуратора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыИсполнителейЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Этапы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторЭтапа</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокВыполненияЧасы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПредшественникиЭтапов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторПоследователя</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторПредшественника</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/РегламентныеИнтервалы/Forms/НастройкаСрокаВыполнения/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Срок выполнения регламентного интервала ""%1""'"),
		Параметры.НаименованиеРегламентногоИнтервала);
	
	СрокЗависитОтВремениНачала = Параметры.СрокЗависитОтВремениНачала;
	ВремяНачала = Параметры.ВремяНачала;
	СрокВыполненияЧасы = Параметры.СрокВыполненияЧасы;
	СрокВыполненияДни = Параметры.СрокВыполненияДни;
	СпособУказанияВремениОкончания = Параметры.СпособУказанияВремениОкончания;
	ВремяОкончания = Параметры.ВремяОкончания;
	СрокВыполненияЧасыПосле = Параметры.СрокВыполненияЧасыПосле;
	СрокВыполненияДниПосле = Параметры.СрокВыполненияДниПосле;
	СпособУказанияВремениОкончанияПосле = Параметры.СпособУказанияВремениОкончанияПосле;
	ВремяОкончанияПосле = Параметры.ВремяОкончанияПосле;
	
	ИспользуютсяГрафикиРаботы = ПроцессыОбработкиДокументовВызовСервера.ИспользуютсяГрафикиРаботы();
	ПредставлениеВариантаДоКонцаДня = ?(ИспользуютсяГрафикиРаботы, НСтр("ru='до конца рабочего дня'"), НСтр("ru='до конца дня'"));
	
	СписокВариантовОкончанияДня.Добавить(0, ПредставлениеВариантаДоКонцаДня);
	СписокВариантовОкончанияДня.Добавить(1, НСтр("ru='до указанного времени:'"));
	СписокВариантовОкончанияДня.Добавить(2, НСтр("ru='окончание дня не указано'"));
	
	ПредставлениеВариантаКонцаДня = СписокВариантовОкончанияДня.НайтиПоЗначению(СпособУказанияВремениОкончания).Представление;
	ПредставлениеВариантаКонцаДняПосле = СписокВариантовОкончанияДня.НайтиПоЗначению(СпособУказанияВремениОкончанияПосле).Представление;
	
	УстановитьСвойстваЭлементовСрок(Элементы, СрокВыполненияЧасы, СпособУказанияВремениОкончания);
	УстановитьСвойстваЭлементовСрокПосле(Элементы, СрокВыполненияЧасыПосле, СпособУказанияВремениОкончанияПосле);
	
	УстановитьВидимостьЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьТекстПодсказки();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СрокВыполненияЗависитОтВремениНачалаПриИзменении(Элемент)
	
	Если СрокЗависитОтВремениНачала Тогда
		
		Если Не ЗначениеЗаполнено(ВремяНачала) Тогда
			ВремяНачала = Дата(1,1,1,12,0,0);
		КонецЕсли;
		
		Если СрокВыполненияДниПосле = 0 И СрокВыполненияЧасыПосле = 0 И СпособУказанияВремениОкончанияПосле = 0 Тогда
			
			СрокВыполненияДниПосле = СрокВыполненияДни;
			СрокВыполненияЧасыПосле = СрокВыполненияЧасы;
			СпособУказанияВремениОкончанияПосле = СпособУказанияВремениОкончания;
			
			УстановитьСвойстваЭлементовСрокПосле(Элементы, СрокВыполненияЧасыПосле, СпособУказанияВремениОкончанияПосле);
			
		КонецЕсли;
		
	Иначе
		СрокВыполненияДниПосле = 0;
		СрокВыполненияЧасыПосле = 0;
		СпособУказанияВремениОкончанияПосле = 0;
	КонецЕсли;
	
	УстановитьВидимостьЭлементовФормы();
	ОбновитьТекстПодсказки();
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеВариантаКонцаДняНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораКонцаДня", ЭтотОбъект);
	ПоказатьВыборИзМеню(Оповещение, СписокВариантовОкончанияДня);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораКонцаДня(ВыбранныйВариант, ДопПараметры) Экспорт
	
	Если ВыбранныйВариант <> Неопределено Тогда
		
		СпособУказанияВремениОкончания = ВыбранныйВариант.Значение;
		ПредставлениеВариантаКонцаДня = ВыбранныйВариант.Представление;
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ВремяОкончанияДня", "Видимость", СпособУказанияВремениОкончания = 1);
		
		Если СпособУказанияВремениОкончания = 1 И Не ЗначениеЗаполнено(ВремяОкончания) Тогда
			ВремяОкончания = Дата(1,1,1,23,59,00);
		КонецЕсли;
		
	КонецЕсли;
	
	ОбновитьТекстПодсказки();
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеВариантаКонцаДняПослеНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораКонцаДняПосле", ЭтотОбъект);
	ПоказатьВыборИзМеню(Оповещение, СписокВариантовОкончанияДня);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораКонцаДняПосле(ВыбранныйВариант, ДопПараметры) Экспорт
	
	Если ВыбранныйВариант <> Неопределено Тогда
		
		СпособУказанияВремениОкончанияПосле = ВыбранныйВариант.Значение;
		ПредставлениеВариантаКонцаДняПосле = ВыбранныйВариант.Представление;
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ВремяОкончанияДняПосле", "Видимость", СпособУказанияВремениОкончанияПосле = 1);
		
		Если СпособУказанияВремениОкончанияПосле = 1 И Не ЗначениеЗаполнено(ВремяОкончанияПосле) Тогда
			ВремяОкончанияПосле = Дата(1,1,1,23,59,00);
		КонецЕсли;
		
	КонецЕсли;
	
	ОбновитьТекстПодсказки();
	
КонецПроцедуры

&НаКлиенте
Процедура СрокВыполненияЧасыПриИзменении(Элемент)
	
	УстановитьСвойстваЭлементовСрок(Элементы, СрокВыполненияЧасы, СпособУказанияВремениОкончания);
	
	ОбновитьТекстПодсказки();
	
КонецПроцедуры

&НаКлиенте
Процедура СрокВыполненияЧасыПослеПриИзменении(Элемент)
	
	УстановитьСвойстваЭлементовСрокПосле(Элементы, СрокВыполненияЧасыПосле, СпособУказанияВремениОкончанияПосле);
	
	ОбновитьТекстПодсказки();
	
КонецПроцедуры

&НаКлиенте
Процедура СрокВыполненияДниПриИзменении(Элемент)
	ОбновитьТекстПодсказки();
КонецПроцедуры

&НаКлиенте
Процедура СрокВыполненияДниПослеПриИзменении(Элемент)
	ОбновитьТекстПодсказки();
КонецПроцедуры

&НаКлиенте
Процедура ВремяОкончанияДняПриИзменении(Элемент)
	ВремяОкончания = НачалоМинуты(ВремяОкончания);
	ОбновитьТекстПодсказки();
КонецПроцедуры

&НаКлиенте
Процедура ВремяОкончанияДняПослеПриИзменении(Элемент)
	ВремяОкончанияПосле = НачалоМинуты(ВремяОкончанияПосле);
	ОбновитьТекстПодсказки();
КонецПроцедуры

&НаКлиенте
Процедура ВремяНачалаЭтапаПриИзменении(Элемент)
	ОбновитьТекстПодсказки();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Готово(Команда)
	
	ДанныеВозврата = Новый Структура;
	ДанныеВозврата.Вставить("СрокЗависитОтВремениНачала", СрокЗависитОтВремениНачала);
	ДанныеВозврата.Вставить("ВремяНачала", ВремяНачала);
	ДанныеВозврата.Вставить("СрокВыполненияЧасы", СрокВыполненияЧасы);
	ДанныеВозврата.Вставить("СрокВыполненияДни", СрокВыполненияДни);
	ДанныеВозврата.Вставить("СпособУказанияВремениОкончания", СпособУказанияВремениОкончания);
	ДанныеВозврата.Вставить("ВремяОкончания", ВремяОкончания);
	ДанныеВозврата.Вставить("СрокВыполненияЧасыПосле", СрокВыполненияЧасыПосле);
	ДанныеВозврата.Вставить("СрокВыполненияДниПосле", СрокВыполненияДниПосле);
	ДанныеВозврата.Вставить("СпособУказанияВремениОкончанияПосле", СпособУказанияВремениОкончанияПосле);
	ДанныеВозврата.Вставить("ВремяОкончанияПосле", ВремяОкончанияПосле);
	
	Закрыть(ДанныеВозврата);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьТекстПодсказки()
	
	СрокИнтервалаПредставление = ПроцессыОбработкиДокументовКлиент.ПредставлениеСрокаВыполненияИнтервала(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементовФормы()
	
	РеквизитыСЗависимостьюОтСрокаСоздания = Новый Массив;
	РеквизитыСЗависимостьюОтСрокаСоздания.Добавить("ГруппаВремяНачала");
	РеквизитыСЗависимостьюОтСрокаСоздания.Добавить("ГруппаПосле");
	
	Для Каждого Реквизит Из РеквизитыСЗависимостьюОтСрокаСоздания Цикл
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, Реквизит, "Видимость", СрокЗависитОтВремениНачала);
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Декорация2", "Заголовок",
		?(СрокЗависитОтВремениНачала, НСтр("ru=' тогда:'"), НСтр("ru='Срок:'")));
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаСроки", "Отображение",
		?(СрокЗависитОтВремениНачала, ОтображениеОбычнойГруппы.СильноеВыделение, ОтображениеОбычнойГруппы.Нет));
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьСвойстваЭлементовСрок(Элементы, СрокВыполненияЧасы, СпособУказанияВремениОкончания)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ПредставлениеВариантаКонцаДня", "Видимость", СрокВыполненияЧасы = 0);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ВремяОкончанияДня", "Видимость", СрокВыполненияЧасы = 0 И СпособУказанияВремениОкончания = 1);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "СрокВыполненияЧасы", "Заголовок", ?(СрокВыполненияЧасы = 0, НСтр("ru='ч,'"), НСтр("ru='ч'")));
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьСвойстваЭлементовСрокПосле(Элементы, СрокВыполненияЧасы, СпособУказанияВремениОкончания)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ПредставлениеВариантаКонцаДняПосле", "Видимость", СрокВыполненияЧасы = 0);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ВремяОкончанияДняПосле", "Видимость", СрокВыполненияЧасы = 0 И СпособУказанияВремениОкончания = 1);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "СрокВыполненияЧасыПосле", "Заголовок", ?(СрокВыполненияЧасы = 0, НСтр("ru='ч,'"), НСтр("ru='ч'")));
	
КонецПроцедуры

#КонецОбласти
